spec/spec/SVAP/AcquiringApplications/Examples/app_flow.example.2004.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://bpc.ru/sv/SVAP">
<soapenv:Header/>
<soapenv:Body>
<application xmlns="http://sv.bpc.in/SVAP">
	<application_type>APTPACQA</application_type>                                       <!-- Application type - Acquiring -->
	<application_flow_id>2004</application_flow_id>                                     <!-- Application flow (business process) - Create new terminal -->
	<application_status>APST0006</application_status>                                   <!-- Application status - Ready to process -->
	<operator_id>ADMIN</operator_id>                                                	<!-- User name who made this application -->
	<institution_id>1001</institution_id>                                               <!-- Institution identifier -->
	<agent_id>10000001</agent_id>                                                       <!-- Agent identifier -->
	<customer>
		<command>CMMDEXPR</command>                                                     <!-- Command for customer - find existing customer -->
		<customer_number>0000000000000000000697</customer_number>                       <!-- Unique customer number -->
		<contract>
			<command>CMMDEXPR</command>                                                 <!-- Command for contract - find existing contract -->
			<contract_number>00000000000000000000000000000736</contract_number>         <!-- Contract number -->
			<merchant id="merchant_1">
				<command>CMMDEXPR</command>                                             <!-- Find existing parent merchant -->
				<merchant_number>000000070000063</merchant_number>                      <!-- Merchant number -->
				<terminal id="terminal_1">                                              <!-- New terminal registration -->
					<command>CMMDCREX</command>                                         <!-- Create new object command -->
					<terminal_number>00000001</terminal_number>                      	<!-- Terminal number -->
					<terminal_type>TRMT0003</terminal_type>                             <!-- Terminal type - POS -->
					<standard_id>1001</standard_id>                                     <!-- Communication standard  -->
					<version_id>1003</version_id>                                       <!-- Version number -->
					<terminal_template>10000007</terminal_template>                     <!-- Reference to terminal template -->
					<device_id>10000017</device_id>                                     <!-- Communication device identifier -->
				</terminal>
			</merchant>
			<service value="70000073">                                                  <!-- define servicing terms for terminal -->
				<service_object ref_id="terminal_1">                                    <!-- Reference to terminal element -->
					<start_date>2015-01-13</start_date>                                 <!-- Servicing start date -->
				</service_object>
			</service>
		</contract>
	</customer>
</application>
</soapenv:Body>
</soapenv:Envelope>
